In [56]:
import pandas as pd
df = pd.read_csv('input.csv')

In [57]:
df

         section
0      8-82,3-96
1    13-95,99-99
2      4-92,5-93
3    16-80,16-80
4     23-36,6-10
..           ...
995  13-13,14-89
996  79-86,86-91
997    4-86,3-87
998  47-92,47-92
999  18-32,17-33

[1000 rows x 1 columns]

In [105]:
def func(row):
    a,b = row.split(',') #üòö
    a1,a2 = a.split('-') # üòê
    b1,b2 = b.split('-')
    a1 = int(a1)
    a2 = int(a2)
    b1 = int(b1)
    b2 = int(b2)
    if((b1<=a1) and (a2<=b2)) or \
       ((a1<=b1) and (b2<=a2)):
        return 1
    else:
        return 0

In [106]:
df['inside'] = df['section'].map(func)

In [107]:
df

         section  inside
0      8-82,3-96       1
1    13-95,99-99       0
2      4-92,5-93       0
3    16-80,16-80       1
4     23-36,6-10       0
..           ...     ...
995  13-13,14-89       0
996  79-86,86-91       0
997    4-86,3-87       1
998  47-92,47-92       1
999  18-32,17-33       1

[1000 rows x 2 columns]

In [108]:
df['inside'].sum()

580

In [116]:
def func2(row):
    a,b = row.split(',') #üòö
    a1,a2 = a.split('-') # üòê
    b1,b2 = b.split('-')
    a1 = int(a1)
    a2 = int(a2)
    b1 = int(b1)
    b2 = int(b2)
    if((a1<=b2) and (a1>=b1)) or \
        ((a2<=b2) and (a2>=b1)) or \
        ((b1<=a2) and (b1>=a1)) or \
        ((b2<=a2) and (b2>=a1)):
        return 1
    else:
        return 0

In [117]:
df['overlap'] = df['section'].map(func2)

In [118]:
df

         section  inside  overlap
0      8-82,3-96       1        1
1    13-95,99-99       0        0
2      4-92,5-93       0        1
3    16-80,16-80       1        1
4     23-36,6-10       0        0
..           ...     ...      ...
995  13-13,14-89       0        0
996  79-86,86-91       0        1
997    4-86,3-87       1        1
998  47-92,47-92       1        1
999  18-32,17-33       1        1

[1000 rows x 3 columns]

In [119]:
df['overlap'].sum()

895